# PhaseArray Class

---
An array that contains phase objects.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPhaseArray
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class PhaseArray : APIObject, IEnumerable

    Public Class PhaseArray
    	Inherits APIObject
    	Implements IEnumerable

    public ref class PhaseArray : public APIObject,
    	IEnumerable

    type PhaseArray =
        class
            inherit APIObject
            interface IEnumerable
        end
The PhaseArray type exposes the following members.
| Name| Description
---|---|---
| PhaseArray| Initializes a new instance of the PhaseArray class
Top
| Name| Description
---|---|---
| IsEmpty| Test to see if the array is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Item| Gets or sets a phase at a specified index within the array.
| Size| Returns the number of phases that are in the array.
Top
| Name| Description
---|---|---
| Append| Add the phase to the end of the array.
| Clear| Removes every phase from the array, rendering it empty.
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| ForwardIterator| Retrieve a forward moving iterator to the array.
| GetEnumerator| Retrieve a forward moving iterator to the array.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Insert| Insert the specified phase into the array.
| ReverseIterator| Retrieve a backward moving iterator to the array.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace